function displayRules()
{
    let rulesDisplay = window.open("", "", "width=25%, height=25%, top=50%, left=50%");
    let textToDisplay = `
<!DOCTYPE html>
<html>
<head>
<meta charset="utf-8">
<title>Saudi Land Marks</title>
</head>
<body>
<main>
<ul>
    <li>يمنع تنزيل محتوى فيه اساءة للوطن</li>
    <li>الالتزام بالاداب و الذوق العام و عدم تنزيل محتوى به لبس خادش للحياء</li>
    <li>يمنع نشر محتوى غير قانوني يستهدف الترويج لممارسات غير شرعية ينطوي عليها مسؤولية مدنية</li>
    <li>يمنع تشويه الصورة العامة لأحد الاشخاص</li>
    <li>يمنع انتحال المستخدم لهوية أحد الأفراد</li>
    <li>يمنع استخدام الموقع في نشر محتوى لا علافة له بالخدمة المقدمة</li>
    <li>يمنع تمثيل أحد المؤسسات أو الهيئات بدون أن يكون المستخدم مخولا بادعاء هذا التمثيل</li>
    <li>يمنع نشر مواد تضر بالملكية الفكرية لأصحابها و تدخل في اطار سرقتها</li>
    <li>صاحب الموقع له الحق في حذف محتواك أو حسابك الشخصي في حال الاخلال بأي من الشروط و الأحكام أعلاه</li>
</ul>
</main>
</body>
</html>`
    rulesDisplay.document.write(textToDisplay);
}